Results/Verifications/S2427/read_only/tidb-server-default.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 166.52 qps: 2676.86 (r/w/o: 2342.73/0.00/334.13) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 193.91 qps: 3100.93 (r/w/o: 2713.01/0.00/387.92) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 200.30 qps: 3205.80 (r/w/o: 2805.30/0.00/400.50) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 204.00 qps: 3264.77 (r/w/o: 2856.68/0.00/408.10) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 200.20 qps: 3200.02 (r/w/o: 2799.62/0.00/400.40) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 204.70 qps: 3276.10 (r/w/o: 2866.80/0.00/409.30) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 201.70 qps: 3229.67 (r/w/o: 2826.17/0.00/403.50) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 203.40 qps: 3253.83 (r/w/o: 2847.03/0.00/406.80) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 201.10 qps: 3217.80 (r/w/o: 2815.70/0.00/402.10) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 202.70 qps: 3244.20 (r/w/o: 2838.80/0.00/405.40) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 203.20 qps: 3249.67 (r/w/o: 2843.18/0.00/406.50) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 200.80 qps: 3214.03 (r/w/o: 2812.42/0.00/401.60) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 197.20 qps: 3152.80 (r/w/o: 2758.40/0.00/394.40) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 201.40 qps: 3221.58 (r/w/o: 2818.88/0.00/402.70) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 196.20 qps: 3142.93 (r/w/o: 2750.42/0.00/392.50) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 195.40 qps: 3125.90 (r/w/o: 2735.10/0.00/390.80) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 191.10 qps: 3058.39 (r/w/o: 2676.19/0.00/382.20) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 174.70 qps: 2792.21 (r/w/o: 2442.91/0.00/349.30) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 191.10 qps: 3062.47 (r/w/o: 2680.18/0.00/382.30) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 200.10 qps: 3198.80 (r/w/o: 2798.70/0.00/400.10) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 196.60 qps: 3146.00 (r/w/o: 2752.70/0.00/393.30) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 200.90 qps: 3213.72 (r/w/o: 2812.02/0.00/401.70) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 202.80 qps: 3243.28 (r/w/o: 2837.68/0.00/405.60) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 202.80 qps: 3245.30 (r/w/o: 2839.60/0.00/405.70) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 200.70 qps: 3214.80 (r/w/o: 2813.40/0.00/401.40) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 202.70 qps: 3239.00 (r/w/o: 2833.70/0.00/405.30) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 199.60 qps: 3195.90 (r/w/o: 2796.60/0.00/399.30) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 198.70 qps: 3180.19 (r/w/o: 2782.80/0.00/397.40) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 200.40 qps: 3204.50 (r/w/o: 2803.70/0.00/400.80) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 199.10 qps: 3185.11 (r/w/o: 2786.90/0.00/398.20) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 193.50 qps: 3097.23 (r/w/o: 2710.22/0.00/387.00) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 197.90 qps: 3164.77 (r/w/o: 2768.98/0.00/395.80) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 198.80 qps: 3183.59 (r/w/o: 2786.00/0.00/397.60) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 192.50 qps: 3078.53 (r/w/o: 2693.53/0.00/385.00) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 184.80 qps: 2957.10 (r/w/o: 2587.60/0.00/369.50) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 190.10 qps: 3041.00 (r/w/o: 2660.80/0.00/380.20) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 198.60 qps: 3177.78 (r/w/o: 2780.48/0.00/397.30) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 198.60 qps: 3178.20 (r/w/o: 2781.00/0.00/397.20) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 200.30 qps: 3202.90 (r/w/o: 2802.30/0.00/400.60) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 201.90 qps: 3229.50 (r/w/o: 2825.70/0.00/403.80) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 199.80 qps: 3196.53 (r/w/o: 2797.02/0.00/399.50) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 199.80 qps: 3198.27 (r/w/o: 2798.58/0.00/399.70) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 200.70 qps: 3212.62 (r/w/o: 2811.32/0.00/401.30) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 198.40 qps: 3174.30 (r/w/o: 2777.40/0.00/396.90) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 194.20 qps: 3102.27 (r/w/o: 2714.08/0.00/388.20) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 196.90 qps: 3155.19 (r/w/o: 2761.20/0.00/394.00) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 190.70 qps: 3049.21 (r/w/o: 2667.81/0.00/381.40) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 191.20 qps: 3061.20 (r/w/o: 2678.80/0.00/382.40) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 192.60 qps: 3081.40 (r/w/o: 2696.20/0.00/385.20) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 195.40 qps: 3122.50 (r/w/o: 2731.80/0.00/390.70) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 186.70 qps: 2992.41 (r/w/o: 2618.90/0.00/373.50) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 196.20 qps: 3138.02 (r/w/o: 2745.61/0.00/392.40) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 196.20 qps: 3139.31 (r/w/o: 2746.91/0.00/392.40) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 201.20 qps: 3220.70 (r/w/o: 2818.30/0.00/402.40) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 206.70 qps: 3306.37 (r/w/o: 2893.07/0.00/413.30) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 201.10 qps: 3215.03 (r/w/o: 2812.83/0.00/402.20) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 198.50 qps: 3177.07 (r/w/o: 2779.98/0.00/397.10) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 197.30 qps: 3155.20 (r/w/o: 2760.70/0.00/394.50) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 199.30 qps: 3192.12 (r/w/o: 2793.52/0.00/398.60) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 12 tps: 197.20 qps: 3155.58 (r/w/o: 2761.08/0.00/394.50) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1656536
        write:                           0
        other:                           236648
        total:                           1893184
    transactions:                        118324 (197.19 per sec.)
    queries:                             1893184 (3155.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0430s
    total number of events:              118324

Latency (ms):
         min:                                   44.38
         avg:                                   60.85
         max:                                  370.82
         95th percentile:                       78.60
         sum:                              7199766.24

Threads fairness:
    events (avg/stddev):           9860.3333/7.77
    execution time (avg/stddev):   599.9805/0.01